tests/performance/frontend-load-test.yml
config:
  target: http://localhost:5174
  phases:
    - duration: 30
      arrivalRate: 10
      name: "Warm up"
    - duration: 60
      arrivalRate: 50
      name: "Sustained load"
    - duration: 30
      arrivalRate: 100
      name: "Peak load"

scenarios:
  - name: "Frontend Load Test"
    weight: 100
    flow:
      - get:
          url: "/"
      - think: 2